Revit 2027 API
BuiltInFailures.DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves Property
 Sketch contains curves to which profiles cannot be applied or chains of curves.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivideVolumesSketchesWithProfileUnfriendlyCurves { get; }
Public Shared ReadOnly Property DivideVolumesSketchesWithProfileUnfriendlyCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivideVolumesSketchesWithProfileUnfriendlyCurves {
	FailureDefinitionId^ get ();
}
static member DivideVolumesSketchesWithProfileUnfriendlyCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace